
&НаКлиенте
Процедура Печать(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьНаСервере(Период.ДатаНачала, Период.ДатаОкончания, ТабДок);
	ТабДок.Показать();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПечатьНаСервере(НачальныйПериод, КонечныйПериод, ТабДок)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Макет = Обработки.РаботаСДокументамиПоступления.ПолучитьМакет("МакетПоступления");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваров.Номер,
		|	ПоступлениеТоваров.Дата,
		|	ПоступлениеТоваров.Контрагент,
		|	ПоступлениеТоваров.Всего
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		|ГДЕ
		|	ПоступлениеТоваров.Дата МЕЖДУ &НачальныйПериод И &КонечныйПериод";
	
	Запрос.УстановитьПараметр("НачальныйПериод", НачальныйПериод);
	Запрос.УстановитьПараметр("КонечныйПериод", КонечныйПериод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ОбластьЗаголовок.Параметры.НачальныйПериод = Формат(НачальныйПериод, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.КонечныйПериод = Формат(КонечныйПериод, "ДФ=dd.MM.yyyy");
	ОбластьЗаголовок.Параметры.КоличествоДокументов = ВыборкаДетальныеЗаписи.Количество();	// get total records from query result
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры
