//==============================================
//		         CLIENT ONLY
// 1. Элементы.<таб.имя>.ТекущиеДанные 
//    => текущая строка табличной части
// 2. Объект.<реквизиты-перем.имя>
// 3. Объект.<таб.имя>.Итог("имя-столбца")
//==============================================

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
	Объект.Всего = Объект.Товары.Итог("Сумма");
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;
	Объект.Всего = Объект.Товары.Итог("Сумма");
КонецПроцедуры

