
&НаКлиенте
Процедура Старт(Команда)
	ГенерацияЭлементовСправочникаНоменклатурыНаСервере(Наименование, Количество);
КонецПроцедуры

&НаСервере
Процедура ГенерацияЭлементовСправочникаНоменклатурыНаСервере(Наименование, Количество)
	НоваяГруппа = Справочники.Номенклатура.СоздатьГруппу();
	НоваяГруппа.Наименование = Наименование;
	НоваяГруппа.Записать();
	Если НоваяГруппа.ПроверитьЗаполнение() и Количество > 0 Тогда
		Для i = 1 По Количество Цикл
			НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
			// 1) НовыйЭлемент.Родитель = Справочники.Наменклатура.НайтиПоНаименованию(НоваяГруппа.Наименование, Истина);
			// 2) НовыйЭлемент.Родитель = Справочники.Наменклатура.НайтиПоКоду(НоваяГруппа.Код, Истина);
			// optimized and better way
			НовыйЭлемент.Родитель = НоваяГруппа.Ссылка;
			НовыйЭлемент.Наименование = Наименование + " " + Строка(i);
			НовыйЭлемент.Записать();
		КонецЦикла;
	Иначе
		Сообщить("Не все данные введены верно");
	КонецЕсли; 
КонецПроцедуры
