// ================== UPDATE ===================
&НаКлиенте
Процедура Изменить(Команда)
	ИзменитьНаСервере(Номенклатура, НовоеНазваниеНоменклатуры);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьНаСервере(Номенклатура, НовоеНазваниеНоменклатуры)
	Объект = Номенклатура.ПолучитьОбъект();		// OBJECT
	Объект.Наименование = НовоеНазваниеНоменклатуры;
	Объект.Записать();		// save changes
КонецПроцедуры

// ================== MARK AS DELETED ===================
&НаКлиенте
Процедура ПоместитьНаУдаление(Команда)
	ПоместитьНаУдалениеНаСервере(Номенклатура);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьНаУдалениеНаСервере(Номенклатура)
	Объект = Номенклатура.ПолучитьОбъект();
	Объект.УстановитьПометкуУдаления(Истина);
КонецПроцедуры

// ================== PHYSICALLY DELETE ===================
&НаКлиенте
Процедура Удалить(Команда)
	УдалитьНаСервере(Номенклатура);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьНаСервере(Номенклатура)
	Объект = Номенклатура.ПолучитьОбъект();
	Объект.Удалить();
КонецПроцедуры

// ================== FIND BY ===================
&НаКлиенте
Процедура НайтиНоменклатуру(Команда)
	НоменклатураСсылка = НайтиНоменклатуруНаСервере(Наименование);
	Сообщить(НоменклатураСсылка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиНоменклатуруНаСервере(Наименование)
	Возврат Справочники.Номенклатура.НайтиПоНаименованию(Наименование);		// OBJECT REF
КонецФункции
