
&НаКлиенте
Процедура Изменить(Команда)
	ИзменитьНаСервере(Номенклатура, НовоеНазваниеНоменклатуры);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьНаСервере(Номенклатура, НовоеНазваниеНоменклатуры)
	Объект = Номенклатура.ПолучитьОбъект();
	Объект.Наименование = НовоеНазваниеНоменклатуры;
	Объект.Записать();		// save changes
КонецПроцедуры


&НаКлиенте
Процедура ПоместитьНаУдаление(Команда)
	ПоместитьНаУдалениеНаСервере(Номенклатура);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьНаУдалениеНаСервере(Номенклатура)
	Объект = Номенклатура.ПолучитьОбъект();
	Объект.УстановитьПометкуУдаления(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	УдалитьНаСервере(Номенклатура);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьНаСервере(Номенклатура)
	Объект = Номенклатура.ПолучитьОбъект();
	Объект.Удалить();
КонецПроцедуры

