// Констант "Граница учета", тип данных - Дата, включен в подсистему "Настройки"
// Общие функции сервера
Функция ПолучитьКонстантГраницуУчета() Экспорт 
	
	Возврат Константы.ГраницаУчета.Получить();

КонецФункции

// Документ: Поступление товаров
&НаКлиенте
Процедура ЭтоНовый(Команда)

	Состояние = ?(Объект.Ссылка.Пустая(), "Это новый", "Это записанный") + " документ";
	
	Предупреждение(Состояние);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Объект.Ссылка.Пустая() И Объект.Дата < ОбщиеФункцииСервера.ПолучитьКонстантГраницуУчета() Тогда
	
		Отказ = Истина;
	
		Сообщить("Нет возможности проведения и перепроведения даты текущего документа");
	
	КонецЕсли;

КонецПроцедуры

// Документ: Реализация товаров
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Сообщить(ОбщиеФункцииСервера.ИнформацияОДокументе(Объект.Ссылка));

	Если НЕ Объект.Ссылка.Пустая() И Объект.Дата < ОбщиеФункцииСервера.ПолучитьКонстантГраницуУчета() Тогда

		Отказ = Истина;

		Сообщить("Нет возможности проведения и перепроведения даты текущего документа");

	КонецЕсли;

КонецПроцедуры
