
&НаКлиенте
Процедура СписокДокументов(Команда)
	СписокДокументовНаСервере(Интервал.ДатаНачала, Интервал.ДатаОкончания);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокДокументовНаСервере(начало, окончание)
	Выборка =  Документы.ПоступлениеТоваров.Выбрать(начало, окончание);
	Пока Выборка.Следующий() Цикл
		//Сообщить("Поступление товаров "+Выборка.Номер+" от "+Выборка.Дата);
		//Сообщить(Строка(Выборка.Ссылка));
		Сообщить(Выборка);
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СписокНезаполненныхДокументов(Команда)
	Список = СписокНезаполненныхДокументовНаСервере();
	Для каждого документ Из Список Цикл
		Сообщить(документ);	
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокНезаполненныхДокументовНаСервере()
	Выборка = Документы.ПоступлениеТоваров.Выбрать();
	НезаполненныеДокументы = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Контрагент.Ссылка.Пустая() Тогда
			НезаполненныеДокументы.Добавить(Выборка.Ссылка);
		КонецЕсли; 
	КонецЦикла; 
	Возврат НезаполненныеДокументы;
КонецФункции
