// Общие модули \ Общие функции сервера
Функция ПолучитьСписокБлижайщихДнейРождения() Экспорт
	// КБД - констант количества ближайщих дней
	// min = 0, max = 365, 5 by default
	КоличествоДней = Константы.КБД.Получить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТАБ.ФИО,
		|	ТАБ.ДатаРождения
		|ИЗ (
		|	ВЫБРАТЬ
		|		Сотрудники.ФИО,
		|		Сотрудники.ДатаРождения,
		|		Сотрудники.Наименование,
		|		РАЗНОСТЬДАТ(&ТекущаяДата, ДОБАВИТЬКДАТЕ(Сотрудники.ДатаРождения, ГОД, РАЗНОСТЬДАТ(Сотрудники.ДатаРождения, &ТекущаяДата, ГОД)), ДЕНЬ) КАК КоличествоОставшихсяДней
		|	ИЗ
		|		Справочник.Сотрудники КАК Сотрудники
		|) КАК ТАБ
		|ГДЕ
		|	ТАБ.КоличествоОставшихсяДней МЕЖДУ 0 И &КоличествоДней";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());	//  '2023.12.31'
	Запрос.УстановитьПараметр("КоличествоДней", КоличествоДней);
	РезультатЗапроса = Запрос.Выполнить();
	
	Результат = "В ближайшие " + Строка(КоличествоДней) + " дни нет рождения никаких сотрудников";
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Запись = РезультатЗапроса.Выбрать();
		Результат = "Сотрудники с днем рождения в ближайшие " + Строка(КоличествоДней) + " дни" + Символы.ПС;
		Номер = 1;
		Пока Запись.Следующий() Цикл
			Результат = Результат + Строка(Номер) + ". ";
			Результат = Результат + Строка(Запись.ФИО) + " (";
			Результат = Результат + Строка(День(Запись.ДатаРождения)) + "/";
			Результат = Результат + Строка(Месяц(Запись.ДатаРождения)) + ")" + Символы.ПС;
			Номер = Номер + 1;
		КонецЦикла;
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции

// Модуль управляемого приложения
Процедура ПриНачалеРаботыСистемы()
	Предупреждение(ОбщиеФункцииСервера.ПолучитьСписокБлижайщихДнейРождения());
КонецПроцедуры

