// Поступление Товаров: Модуль объекта
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Закупки Приход
	Движения.Закупки.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Закупки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Контрагент = Контрагент;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Цена = ТекСтрокаТовары.Цена;
	КонецЦикла;

	// регистр ОстаткиНоменклатуры Приход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


// Реализация Товаров: Модуль объекта

Процедура ОбработкаПроведения(Отказ, Режим)
	ДобавляющиеТовары = Новый Массив;
	
	// регистр Продажи Расход
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		ДобавляющиеТовары.Добавить(Движение.Номенклатура);
		Движение.Контрагент = Контрагент;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Цена = ТекСтрокаТовары.Цена;
	КонецЦикла;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Закупки.Номенклатура,
		|	СУММА(Закупки.Количество) КАК Остаток
		|ПОМЕСТИТЬ ОперацияСТоварами
		|ИЗ
		|	РегистрНакопления.Закупки КАК Закупки
		|ГДЕ
		|	Закупки.Период В (Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	Закупки.Номенклатура
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Продажи.Номенклатура,
		|	СУММА(-Продажи.Количество)
		|ИЗ
		|	РегистрНакопления.Продажи КАК Продажи
		|ГДЕ
		|	Продажи.Период В (Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	Продажи.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОперацияСТоварами.Номенклатура,
		|	СУММА(ОперацияСТоварами.Остаток) КАК Остаток
		|ПОМЕСТИТЬ ТекущийОстатокТоваров
		|ИЗ
		|	ОперацияСТоварами КАК ОперацияСТоварами
		|
		|СГРУППИРОВАТЬ ПО
		|	ОперацияСТоварами.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущийОстатокТоваров.Номенклатура,
		|	ТекущийОстатокТоваров.Остаток
		|ИЗ
		|	ТекущийОстатокТоваров КАК ТекущийОстатокТоваров
		|ГДЕ
		|	ТекущийОстатокТоваров.Остаток < 0";
	
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ДобавляющиеТовары.Найти(ВыборкаДетальныеЗаписи.Номенклатура) <> Неопределено Тогда
				Отказ = Истина;
				Сообщить("Не достаточно количество "+ВыборкаДетальныеЗаписи.Номенклатура+". Надо заполнить "+(-ВыборкаДетальныеЗаписи.Остаток)+" ед. сначала");
			КонецЕсли; 
		КонецЦикла;

	КонецЕсли;  
	
	// регистр ОстаткиНоменклатуры Расход
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиНоменклатуры.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
