//
// 1. Создать регистр сведений: СогласованныеДокументы 
// 		- Реквизит: Документ (тип: ДокументСсылка)
//
// 2. Создать реквизит Согласован в форме документа ПоступлениеТоваров 
// 		- тип: Булево
// 		- Только смотр: Да
//
// 3. Дописать 2 процедуры
//		- [Сервер] ПриСозданииНаСервере()
//		- [Клиент] ПриОткрытии()
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СогласованыеДокументы.Документ
			|ИЗ
			|	РегистрСведений.СогласованыеДокументы КАК СогласованыеДокументы
			|ГДЕ
			|	СогласованыеДокументы.Документ = &Документ";
		
		Запрос.УстановитьПараметр("Документ", Объект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Согласован = НЕ РезультатЗапроса.Пустой();
		
		Сообщить(ОбщиеФункцииСервера.ИнформацияОДокументе(Объект.Ссылка));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Элементы.Дата.Доступность = Ложь;

КонецПроцедуры
