// 
// 1. В модуле формы документа ПоступлениеТоваров
// 		- Процедура (Клиентская и Серверная)
// 		- Вызов процедуры модуля объекта ОБЯЗАТЕЛЬНО из сервера
// 
&НаКлиенте
Процедура ИзменитьДанные(Команда)
	// Этап 1. Вызов серверной процедуры
	ИзменитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьДанныеНаСервере()
	// Этап 2. Преобразование основного реквизита формы в прикладной объект
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	// Этап 3. Вызов процедуры модуля объекта
	ТабЧасть = ДокументОбъект.Товары;
	ДокументОбъект.ОчиститьСтрокиСНезаполненнойЦеной(ТабЧасть);
		
	// Этап 4. Обратное преобразование прикладного объекта в реквизит формы
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры

// 
// 2. Модуль объекта документа ПоступлениеТоваров
// 		- Процедура серверная и экспортная
// 
Процедура ОчиститьСтрокиСНезаполненнойЦеной(ТабЧасть) Экспорт

	СтруктураДляПоиска = Новый Структура("Цена", 0);
	
	МассивПустыхСтрок = ТабЧасть.НайтиСтроки(СтруктураДляПоиска);
	
	Для каждого Строка Из МассивПустыхСтрок Цикл
		
		Сообщить("Строка "+Строка.НомерСтроки+" удалена.");
		
	КонецЦикла;
	
	Для каждого Строка Из МассивПустыхСтрок Цикл
		
		ТабЧасть.Удалить(Строка);
		
	КонецЦикла;

КонецПроцедуры
