&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	
	ЭтоНеПоставщик = НайтиПоставщикНаСервере(Элемент.ВыделенныйТекст);
	
	Если ЭтоНеПоставщик Тогда
		
		Сообщить("Документ не может быть проведен так как "+Элемент.ВыделенныйТекст+" не является поставщиком.");
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НайтиПоставщикНаСервере(Наименование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Наименование
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Родитель.Наименование = ""Поставщики""
		|	И Контрагенты.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		
		...
		
		Если Объект.Контрагент.Родитель.Наименование <> "Поставщики" Тогда
		
			Сообщить("Документ не может быть проведен так как "+Объект.Контрагент+" не является поставщиком.");
		
		КонецЕсли; 
		
		...
		
	КонецЕсли;
	
КонецПроцедуры
