&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	
	Контрагент = Элемент.ВыделенныйТекст;
	
	ЭтоНеПоставщик = НайтиПоставщикНаСервере(Контрагент);
	
	Если ЭтоНеПоставщик Тогда
		
		Сообщить("Документ не может быть проведен так как "+Контрагент+" не является поставщиком.");
		
	Иначе
		
		ФлагЗаполнения = Истина;	// флаг выполнения действия
		
		Если Объект.Товары.Количество() > 0 Тогда
			
			Ответ = Вопрос("Документ будет заполнен по данным последнего проведенного документа. Продолжить?", РежимДиалогаВопрос.ОКОтмена);
		
			Если Ответ = КодВозвратаДиалога.Отмена Тогда	// пользователь откажет выполнить действие
		
				ФлагЗаполнения = Ложь;
			
			КонецЕсли;
			
		КонецЕсли;
		
		Если ФлагЗаполнения Тогда
		
			ЗаполнитьТоварыПоКонтрагентамНаСервере(Контрагент);	// главный процесс заполнения
		
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыПоКонтрагентамНаСервере(Контрагент)
	
	// Этап 1. Преобразование основного реквизита формы в прикладной объект
	//ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	// Этап 2. Вызов табличной части из объекта
	//ТабЧасть = ДокументОбъект.Товары;
	ТабЧасть = Объект.Товары;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПоступлениеТоваров.Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		|ГДЕ
		|	ПоступлениеТоваров.Контрагент.Наименование = &Контрагент
		|	И ПоступлениеТоваров.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПоступлениеТоваров.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл		// ТОЛЬКО 1 ЗАПИСЬ
		
		// Этап 3. Очистка текущей таблицы
		ТабЧасть.Очистить();
		
		// Этап 4. Заполнение каждой строки в таблице 
		Для каждого Товар Из Выборка.Ссылка.Товары Цикл
		
			НоваяСтрока = ТабЧасть.Добавить();                  	// создание новой строки таблицы
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар);	// ЗАПОЛНИТЬЗНАЧЕНИЯСВОЙСТВ()
		
		КонецЦикла;
		
		//ДокументОбъект.Всего = Выборка.Ссылка.Всего;		// поправка суммы таблицы
		Объект.Всего = Выборка.Ссылка.Всего;		// поправка суммы таблицы
		
	КонецЦикла;
	
	// Этап 5. Обратное преобразование прикладного объекта в реквизит формы
	//ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры