&НаКлиенте
Процедура СоздатьЭлемент(Команда)
	СоздатьЭлементНаСервере(Наименование, ИНН, Телефон);
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементНаСервере(Наименование, ИНН, Телефон)
	Элемент = Справочники.Контрагенты.СоздатьЭлемент();
	Элемент.Наименование = Наименование;
	Элемент.ИНН = ИНН;
	Элемент.Телефон = Телефон;
	Элемент.Записать();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьГруппу(Команда)
	ОткрытьФорму("Справочник.Контрагенты.ФормаГруппы", Новый Структура("ЭтоГруппа", Истина));
КонецПроцедуры
