// TODO: Using Свойство: ПроизвольныйЗапрос (List Form)

&НаСервереБезКонтекста
Функция СписокПриАктивизацииСтрокиНаСервере(Код)
	
	Результаты = Новый Массив;
	
	Видимость = НЕ Справочники.Контрагенты.НайтиПоКоду(Код).ЭтоГруппа;
	
	Результаты.Добавить(Видимость);
	
	Если Видимость Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(ПоступлениеТоваров.Всего) КАК Закупки
			|ИЗ
			|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
			|ГДЕ
			|	ПоступлениеТоваров.Контрагент.Код = &Код
			|
			|СГРУППИРОВАТЬ ПО
			|	ПоступлениеТоваров.Контрагент";
		
		Запрос.УстановитьПараметр("Код", Код);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Закупки = 0;
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
		
			Выборка = РезультатЗапроса.Выбрать();
		
			Пока Выборка.Следующий() Цикл
				
				Закупки = Выборка.Закупки;
				
			КонецЦикла;
		
		КонецЕсли; 
		
		Результаты.Добавить(Закупки);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(РеализацияТоваров.Всего) КАК Продажи
			|ИЗ
			|	Документ.РеализацияТоваров КАК РеализацияТоваров
			|ГДЕ
			|	РеализацияТоваров.Контрагент.Код = &Код
			|
			|СГРУППИРОВАТЬ ПО
			|	РеализацияТоваров.Контрагент";
		
		Запрос.УстановитьПараметр("Код", Код);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Продажи = 0;
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
		
			Выборка = РезультатЗапроса.Выбрать();
		
			Пока Выборка.Следующий() Цикл
		
				Продажи = Выборка.Продажи;
			
			КонецЦикла;
			
		КонецЕсли; 
		
		Результаты.Добавить(Продажи);
			
	КонецЕсли; 
	
	Возврат Результаты;
	
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Ссылка = Элементы.Список.ТекущиеДанные;
	
	Результаты = СписокПриАктивизацииСтрокиНаСервере(Ссылка.Код);
	
	Элементы.ГруппаИнформации.Видимость = Результаты[0];
	
	Если Результаты[0] Тогда
	
		Закупки = Результаты[1];
	
		Продажи = Результаты[2];
	
	КонецЕсли;
	
КонецПроцедуры
