
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент;
	ПоказатьПрайлист(ТабДок, ТекущаяДата());
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ПоказатьПрайлист(ТабДок, Дата)

	Макет = ПолучитьОбщийМакет("МакетПрайслист");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РозничныеЦеныСрезПоследних.Номенклатура,
		|	РозничныеЦеныСрезПоследних.Цена
		|ИЗ
		|	РегистрСведений.РозничныеЦены.СрезПоследних КАК РозничныеЦеныСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	ОбластьДетальныхЗаписейЦвет = Макет.ПолучитьОбласть("ДеталиЦвет");
	
	// ОбластьЗаголовок.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
	
	ТабДок.Очистить();  
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	Четный = Ложь;
	Пока Выборка.Следующий() Цикл
		Если Четный Тогда
			ОбластьДетальныхЗаписей.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьДетальныхЗаписей, Выборка.Уровень());
		Иначе
		    ОбластьДетальныхЗаписейЦвет.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьДетальныхЗаписейЦвет, Выборка.Уровень());
		КонецЕсли; 
		
		Четный = НЕ Четный;
		
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	 	
КонецПроцедуры
 