
&НаКлиенте
Процедура Остаток(Команда)

	ОстатокНаСервере(Номенклатура);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОстатокНаСервере(Номенклатура)

	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакупкиОстатки.КоличествоОстаток + ПродажиОстатки.КоличествоОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.Продажи.Остатки(, Номенклатура = &Номенклатура) КАК ПродажиОстатки,
		|	РегистрНакопления.Закупки.Остатки(, Номенклатура = &Номенклатура) КАК ЗакупкиОстатки";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Сообщить(ВыборкаДетальныеЗаписи.Остаток);

	КонецЦикла;

КонецПроцедуры
