
&НаКлиенте
Процедура Курсы(Команда)

	КурсыНаСервере(Валюта);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура КурсыНаСервере(Валюта)

	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Сообщить("Текущий курс валюты "+Валюта+" = "+ВыборкаДетальныеЗаписи.Курс+" рублей");

	КонецЦикла;
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(КурсыВалют.Курс) КАК МакКурс,
		|	МИНИМУМ(КурсыВалют.Курс) КАК МинКурс
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Сообщить("Максимальный курс валюты "+Валюта+" = "+ВыборкаДетальныеЗаписи.МакКурс+" рублей");

		Сообщить("Минимальный курс валюты "+Валюта+" = "+ВыборкаДетальныеЗаписи.МинКурс+" рублей");

	КонецЦикла;
	
КонецПроцедуры
